import { sumsOfParts, sample1 } from "../src/sumsOfParts";

describe("自分の回答", () => {
  test("小さい数字", () => {
    expect(sumsOfParts([1, 2, 3, 4, 5, 6])).toStrictEqual([
      21,
      20,
      18,
      15,
      11,
      6,
      0,
    ]);
  })

  test("大きい数字", () => {
    expect(
      sumsOfParts([
        744125,
        935,
        407,
        454,
        430,
        90,
        144,
        6710213,
        889,
        810,
        2579358,
      ])
    ).toStrictEqual([
      10037855,
      9293730,
      9292795,
      9292388,
      9291934,
      9291504,
      9291414,
      9291270,
      2581057,
      2580168,
      2579358,
      0,
    ]);
  })

  test("空の配列の場合は0を返す", () => {
    expect(sumsOfParts([])).toStrictEqual([0]);
  });
})

describe("良い回答", () => {
    test("小さい数字", () => {
      expect(sample1([1, 2, 3, 4, 5, 6])).toStrictEqual([
        21,
        20,
        18,
        15,
        11,
        6,
        0,
      ]);
    });

    test("大きい数字", () => {
      expect(
        sample1([
          744125,
          935,
          407,
          454,
          430,
          90,
          144,
          6710213,
          889,
          810,
          2579358,
        ])
      ).toStrictEqual([
        10037855,
        9293730,
        9292795,
        9292388,
        9291934,
        9291504,
        9291414,
        9291270,
        2581057,
        2580168,
        2579358,
        0,
      ]);
    });

    test("空の配列の場合は0を返す", () => {
      expect(sample1([])).toStrictEqual([0]);
    });
})